app/views/homepage/index.html.erb

              <td><a href=<% lesson_path(lesson) %>><%= lesson.title%></a></td>
              <td><%= User.where(id: lesson.user_id).first.email %></td>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]