app/views/user/messages/new.html.erb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["email", "georent123@hotmail.com"]]
---
      </div>
      <%= f.hidden_field :receiver_id,:value => User.where(email: params[:email]).first.id %>