app/views/comments/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
---
      <div class="panel panel-default ">
        <div class="panel-heading" id="highlighted">Comment by: <%= User.where(id: comment.user_id).first.email %>