app/controllers/admin/lessons_controller.rb

  def index
    @lessons = Lesson.all
---
SELECT "lessons".* FROM "lessons"

  def create
    @lesson = Lesson.new(admin_lesson_params)
    @lesson.user_id = current_user.id
    if @lesson.save
---
INSERT INTO "lessons" ("title", "description", "category_id", "level", "user_id", "slug", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    if @lesson.update(admin_lesson_params)
---
UPDATE "lessons" SET "slug" = $1, "title" = $2, "updated_at" = $3 WHERE "lessons"."id" = $4  [["slug", "setsets2144"], ["title", "setsets2144"], ["updated_at", "2016-03-02 15:16:25.527724"], ["id", 7]]

  def find_lesson
    @lesson = Lesson.friendly.find(params[:id])
---
SELECT  "lessons".* FROM "lessons" WHERE "lessons"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]