app/controllers/admin/messages_controller.rb

SELECT "messages".* FROM "messages" WHERE "messages"."receiver_id" = $1  [["receiver_id", 2]]
---
  def received
    @messages = Message.where(receiver_id: current_user.id)