app/controllers/admin/users_controller.rb

  def destroy
    if @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 5]]

  def find_user
    @user = User.friendly.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 4]]