app/controllers/user/lessons_controller.rb

  def index
    @lessons = Lesson.where(user_id: current_user.id).all
---
SELECT "lessons".* FROM "lessons" WHERE "lessons"."user_id" = $1  [["user_id", 2]]

  def create
    @lesson = Lesson.new(lesson_params)
    @lesson.user_id = current_user.id
    if @lesson.save
---
INSERT INTO "lessons" ("title", "description", "category_id", "level", "user_id", "slug", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def find_lesson
    @lesson = Lesson.friendly.find(params[:id])
---
SELECT  "lessons".* FROM "lessons" WHERE "lessons"."id" = $1 LIMIT 1  [["id", 3]]