app/controllers/user/messages_controller.rb

  def received
    @messages = Message.where(receiver_id: current_user.id)
---
SELECT "messages".* FROM "messages" WHERE "messages"."receiver_id" = $1  [["receiver_id", 2]]

  def sent
    @messages = Message.where(sender_id: current_user.id)
---
SELECT "messages".* FROM "messages" WHERE "messages"."sender_id" = $1  [["sender_id", 2]]

  def show
    @message.read = true
    @message.save
---
UPDATE "messages" SET "read" = $1, "updated_at" = $2 WHERE "messages"."id" = $3  [["read", "t"], ["updated_at", "2016-02-01 08:09:47.099867"], ["id", 1]]

  def create
    @message = Message.new(message_params)
    if @message.save
---
INSERT INTO "messages" ("title", "body", "receiver_id", "sender_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "test"], ["body", "test"], ["receiver_id", 3], ["sender_id", 3], ["created_at", "2016-01-31 15:14:48.717243"], ["updated_at", "2016-01-31 15:14:48.717243"]]

  def find_message
    @message = Message.find(params[:id])
---
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT 1  [["id", 1]]