app/controllers/user/users_controller.rb

  def index
    @comments = current_user.lessons.last.try(:comments)
---
SELECT  "lessons".* FROM "lessons" WHERE "lessons"."user_id" = $1  ORDER BY "lessons"."id" DESC LIMIT 1  [["user_id", 1]]

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "bio", "encrypted_password", "slug", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "georent1234@hotmail.com"], ["updated_at", "2016-01-31 14:53:57.087536"], ["id", 2]]

  def find_user

    @user = User.friendly.find(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 4]]