app/views/admin/lessons/index.html.erb

      <td><%= lesson.level %></td>
      <td><%= Category.where(id: lesson.category_id).first.name %></td>
      <td><%= User.where(id: lesson.user_id).first.email %></td>
      <td><%= lesson.uploads.count %></td>
      <% if lesson.lesson_ratings.count > 0 %>
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1  ORDER BY "categories"."id" ASC LIMIT 1  [["id", 13]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
SELECT "lesson_ratings".* FROM "lesson_ratings" WHERE "lesson_ratings"."lesson_id" = $1  [["lesson_id", 2]]
SELECT "lessons".* FROM "lessons"
SELECT COUNT(*) FROM "lesson_ratings" WHERE "lesson_ratings"."lesson_id" = $1  [["lesson_id", 2]]