app/views/admin/messages/received.html.erb

          <td><%= message.body %></td>
          <td><%= User.where(id: message.sender_id).first.email %></td>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]