app/views/users/_usersidemenu.html.erb

SELECT COUNT(*) FROM "contact_messages" WHERE "contact_messages"."read" = 'f'
---
        <li><%= link_to "Contact Messages" ,contact_messages_path,:class=>"profile_links" %>
          <% if ContactMessage.where(read: false).count > 0 %>

SELECT COUNT(*) FROM "messages" WHERE "messages"."read" = 'f' AND "messages"."receiver_id" = $1  [["receiver_id", 1]]
---
      <li><a href="<%= received_user_messages_path %>" class="profile_links">Received</a>
        <% if Message.where(read: false ).where(receiver_id: current_user.id).count > 0 %>