app/views/user/lessons/index.html.erb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1  ORDER BY "categories"."id" ASC LIMIT 1  [["id", 13]]
---
          <td><%= lesson.level %></td>
          <td><%= Category.where(id: lesson.category_id).first.name %></td>