app/views/user/users/index.html.erb

          <% @uploads = 0 %>
            <% current_user.lessons.each do |lesson| %>
---
SELECT "lessons".* FROM "lessons" WHERE "lessons"."user_id" = $1  [["user_id", 1]]

            <td>Lessons</td>
            <td> <%= current_user.lessons.count %></td>
---
SELECT COUNT(*) FROM "lessons" WHERE "lessons"."user_id" = $1  [["user_id", 1]]

        <table class="table">
        <% @categories = Category.all %>
---
SELECT "categories".* FROM "categories"

            <td><%= category.name %></td>
            <td> <%= current_user.lessons.where(category_id: category.id).count %></td>
---
SELECT COUNT(*) FROM "lessons" WHERE "lessons"."user_id" = $1 AND "lessons"."category_id" = $2  [["user_id", 1], ["category_id", 1]]

    <div class="col-sm-4">
      <% @comments = current_user.comments.limit(5)   %>
---
SELECT  "comments".* FROM "comments" WHERE "comments"."user_id" = $1 LIMIT 5  [["user_id", 1]]