app/views/lessons/index.html.erb

      <% @lessons.each do |lesson| %>
        <% @user = User.find(lesson.user_id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]

          <td><%= link_to lesson.title,lesson_path(lesson) %></td>
          <td><%= Category.where(id: lesson.category_id).first.name %></td>
          <td><%= lesson.level %></td>
          <% if lesson.lesson_ratings.count > 0 %>
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1  ORDER BY "categories"."id" ASC LIMIT 1  [["id", 1]]
SELECT "lesson_ratings".* FROM "lesson_ratings" WHERE "lesson_ratings"."lesson_id" = $1  [["lesson_id", 2]]
SELECT "lessons".* FROM "lessons"
SELECT COUNT(*) FROM "lesson_ratings" WHERE "lesson_ratings"."lesson_id" = $1  [["lesson_id", 1]]
SELECT COUNT(*) FROM "lessons"