app/views/lessons/show.html.erb

  	<td>
    	<strong>Category:</strong><%= Category.where(id: @lesson.first.category_id).name %>
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1  ORDER BY "categories"."id" ASC LIMIT 1  [["id", 13]]

  	<td>
    	<strong>Teacher:</strong><%= User.where(id: @lesson.first.user_id).first.email %> <br>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]

    <% end %>
    <% if @lesson.first.comments.count > 0 %>
---
SELECT  "comments".* FROM "comments" WHERE "comments"."lesson_id" = $1  ORDER BY "comments"."id" DESC LIMIT 1  [["lesson_id", 2]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."lesson_id" = $1  [["lesson_id", 2]]