app/views/admin/categories/index.html.erb

      <td><%= category.name %></td>
      <td><%= category.lessons.count %></td>
---
SELECT COUNT(*) FROM "lessons" WHERE "lessons"."category_id" = $1  [["category_id", 13]]