app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories"
---
  def index
  	# if current_user
     	@categories = Category.all