app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."lesson_id" = $1  [["lesson_id", 2]]
---
	def index
		@comments = Comment.where(lesson_id: params[:lesson_id])

SELECT  "lessons".* FROM "lessons" WHERE "lessons"."id" = $1  ORDER BY "lessons"."id" ASC LIMIT 1  [["id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
INSERT INTO "comments" ("comment", "lesson_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["comment", "Test_comment"], ["lesson_id", 2], ["user_id", 2], ["created_at", "2016-01-31 15:02:03.047971"], ["updated_at", "2016-01-31 15:02:03.047971"]]
---
	def create
		@comment = Comment.new(comment_params)
		@comment.user_id = current_user.id
		@lesson = Lesson.where(id: @comment.lesson_id).first
		if @comment.save