app/controllers/contact_messages_controller.rb

  def index
    @contact_messages = ContactMessage.all
---
SELECT "contact_messages".* FROM "contact_messages"

  def create
    @contact_message = ContactMessage.new(contact_message_params)
    if @contact_message.save
---
INSERT INTO "contact_messages" ("first_name", "last_name", "subject", "email", "message", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def show
    @contact_message = ContactMessage.find(params[:id])
    @contact_message.read = true
    @contact_message.save
---
SELECT  "contact_messages".* FROM "contact_messages" WHERE "contact_messages"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "contact_messages" SET "read" = $1, "updated_at" = $2 WHERE "contact_messages"."id" = $3  [["read", "t"], ["updated_at", "2016-01-31 20:52:52.934840"], ["id", 1]]