app/controllers/lessons_controller.rb

SELECT "lessons".* FROM "lessons"
---
  def index
    if current_user
      if params[:category_id]!=nil
        @lessons = Lesson.where(category_id: params[:category_id])
      else
        @lessons = Lesson.search(params[:search])

SELECT  "lessons".* FROM "lessons" WHERE "lessons"."slug" = $1  ORDER BY "lessons"."id" ASC LIMIT 1  [["slug", "test_lesson"]]
---
  def show
    @lesson = Lesson.where(slug: params[:id]);

SELECT  "users".* FROM "users" WHERE "users"."slug" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["slug", "georent123-hotmail-com"]]
---
  def show_author
    @user = User.where(slug: params[:id])