app/controllers/lesson_ratings_controller.rb

  def create
  	@lesson_rating = LessonRating.new(lesson_rating_params)
  	@lesson_rating.avg = (@lesson_rating.communication + @lesson_rating.quality + @lesson_rating.teaching + @lesson_rating.general_grade) / 4
		@lesson = Lesson.where(id: @lesson_rating.lesson_id).first
		if @lesson_rating.save
---
SELECT  "lessons".* FROM "lessons" WHERE "lessons"."id" = $1  ORDER BY "lessons"."id" ASC LIMIT 1  [["id", 2]]
INSERT INTO "lesson_ratings" ("communication", "quality", "teaching", "general_grade", "user_id", "lesson_id", "avg", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"