app/views/admin/users/index.html.erb

      <td><%= user.last_name %></td>
      <% if user.lessons.count > 0 %>
---
SELECT "lessons".* FROM "lessons" WHERE "lessons"."user_id" = $1  [["user_id", 3]]
SELECT COUNT(*) FROM "lessons" WHERE "lessons"."user_id" = $1  [["user_id", 2]]

          <% @lavg = 0 %>
          <% l.lesson_ratings.each do |r| %>
---
SELECT "lesson_ratings".* FROM "lesson_ratings" WHERE "lesson_ratings"."lesson_id" = $1  [["lesson_id", 2]]

          <% @lessonavg = 0 %>
          <% @lessonavg = @lavg / l.lesson_ratings.count %>
---
SELECT COUNT(*) FROM "lesson_ratings" WHERE "lesson_ratings"."lesson_id" = $1  [["lesson_id", 3]]